app/controllers/students_controller.rb

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgenson"], ["updated_at", "2021-03-16 22:12:50.270994"], ["id", 1]]
---
  def update
    find_student
    @student.update(first_name: student_params[:first_name], last_name: student_params[:last_name])